In [1]:
people = {
    "first": ["Anish", 'Developer', 'Tester'], 
    "last": ["Sebastian", 'devlast', 'testlast'], 
    "email": ["ats@gmail.com", 'devlast@email.com', 'test@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

       first       last              email
0      Anish  Sebastian      ats@gmail.com
1  Developer    devlast  devlast@email.com
2     Tester   testlast     test@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
# update columns
df.columns = [ 'first_name', 'last_name', 'email']

In [7]:
df

  first_name  last_name              email
0      Anish  Sebastian      ats@gmail.com
1  Developer    devlast  devlast@email.com
2     Tester   testlast     test@email.com

In [8]:
# rename columns
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [9]:
df

       first       last              email
0      Anish  Sebastian      ats@gmail.com
1  Developer    devlast  devlast@email.com
2     Tester   testlast     test@email.com

In [10]:
# make columns upper using list comprehension
df.columns = [x.upper() for x in df.columns]
df

       FIRST       LAST              EMAIL
0      Anish  Sebastian      ats@gmail.com
1  Developer    devlast  devlast@email.com
2     Tester   testlast     test@email.com

In [11]:
# make columns upper using list comprehension
df.columns = [x.lower() for x in df.columns]
df

       first       last              email
0      Anish  Sebastian      ats@gmail.com
1  Developer    devlast  devlast@email.com
2     Tester   testlast     test@email.com

In [12]:
# update all columsn using loc
df.loc[1] = ['Developer', 'DevLast', 'devlast@email.com']

In [13]:
df

       first       last              email
0      Anish  Sebastian      ats@gmail.com
1  Developer    DevLast  devlast@email.com
2     Tester   testlast     test@email.com

In [16]:
# update specific cols
df.loc[1, ['last', 'first']] = ["DeveloperFirst", "DeveloperLast"]
df

           first            last              email
0          Anish       Sebastian      ats@gmail.com
1  DeveloperLast  DeveloperFirst  devlast@email.com
2         Tester        testlast     test@email.com

In [19]:
# update single col
df.loc[1, 'last'] = 'DevLastName'
df

           first         last              email
0          Anish    Sebastian      ats@gmail.com
1  DeveloperLast  DevLastName  devlast@email.com
2         Tester     testlast     test@email.com

In [20]:
# update single col using .at
df.at[1, 'last'] = 'Doe'
df

           first       last              email
0          Anish  Sebastian      ats@gmail.com
1  DeveloperLast        Doe  devlast@email.com
2         Tester   testlast     test@email.com

In [22]:
# update using filter
filt = (df['email'] == 'test@email.com')
df.loc[filt, 'last'] = 'TestLast'
df

           first       last              email
0          Anish  Sebastian      ats@gmail.com
1  DeveloperLast        Doe  devlast@email.com
2         Tester   TestLast     test@email.com

In [26]:
# update multiple rows
df['email'] = df['email'].str.upper()
df

           first       last              email
0          Anish  Sebastian      ATS@GMAIL.COM
1  DeveloperLast        Doe  DEVLAST@EMAIL.COM
2         Tester   TestLast     TEST@EMAIL.COM

In [28]:
# using apply function
df['email'].apply(len)

0    13
1    17
2    14
Name: email, dtype: int64

In [29]:
def update_email(email):
    return email.lower()

In [30]:
df['email'].apply(update_email)

0        ats@gmail.com
1    devlast@email.com
2       test@email.com
Name: email, dtype: object

In [31]:
df['email'] = df['email'].apply(update_email)
df

           first       last              email
0          Anish  Sebastian      ats@gmail.com
1  DeveloperLast        Doe  devlast@email.com
2         Tester   TestLast     test@email.com

In [34]:
# using lambad function with apply
df['email'] = df['email'].apply(lambda x: x.lower())
df

           first       last              email
0          Anish  Sebastian      ats@gmail.com
1  DeveloperLast        Doe  devlast@email.com
2         Tester   TestLast     test@email.com

In [35]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [36]:
len(df['email'])

3

In [37]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [40]:
# using applymap - only works on data frame
df.applymap(len)

   first  last  email
0      5     9     13
1     13     3     17
2      6     8     14

In [39]:
df.applymap(str.lower)

           first       last              email
0          anish  sebastian      ats@gmail.com
1  developerlast        doe  devlast@email.com
2         tester   testlast     test@email.com

In [43]:
df['first'].map({'Anish': "Suresh", "Tester": "Tester"})

0    Suresh
1       NaN
2    Tester
Name: first, dtype: object

In [44]:
df

           first       last              email
0          Anish  Sebastian      ats@gmail.com
1  DeveloperLast        Doe  devlast@email.com
2         Tester   TestLast     test@email.com

In [47]:
# use replace
df['first'] = df['first'].replace({'Anish': "Suresh", "Tester": "Tester"})

In [48]:
df

           first       last              email
0         Suresh  Sebastian      ats@gmail.com
1  DeveloperLast        Doe  devlast@email.com
2         Tester   TestLast     test@email.com